{
  "mahadasha": {
    "Ketu": {
      "duration_years": 7,
      "summary": "Ketu Mahadasha lasts 7 years and is the first period in the 120-year Vimshottari Dasha cycle. Ketu is described in classical texts as a headless, truth-seeking influence that brings surrender and spiritual detachment.\n\nDuring this period you may experience sudden and unexpected changes in circumstances that push you out of your comfort zone. There is often a pull towards spirituality, mysticism, meditation, and detachment from purely material pursuits. Career and relationships can see instability or sudden turns—break in job, shifts in role, or evolution in how you relate to partners and family. If Ketu is strong and well placed, the period can support foreign settlement, spiritual upliftment, success in research or occult fields, and intuitive abilities. When Ketu is weak or rules difficult houses, there may be sudden financial loss, clashes of opinion, stress in relationships, or health issues due to neglect. The exact results depend on Ketu's house, sign, nakshatra, and aspects in your birth chart."
    },
    "Venus": {
      "duration_years": 20,
      "summary": "Venus Mahadasha runs for 20 years and strongly influences luxury, marriage, partnership, arts, vehicles, and material comforts.\n\nWhen Venus is well placed in the birth chart, this period can bring wealth, romantic fulfilment, marriage or deepening of marriage, gains through arts or creative work, and a generally comfortable lifestyle. There may be support from spouse, family, and social circles. When Venus is afflicted or rules difficult houses, the same areas can see delays, over-expenditure, relationship strain, or fluctuations in income. The results depend on Venus's house and sign placement, its dignity, and the houses it rules in your chart."
    },
    "Sun": {
      "duration_years": 6,
      "summary": "Sun Mahadasha lasts 6 years and emphasises authority, government or senior connections, father, vitality, and self-expression.\n\nA strong and well-placed Sun can bring recognition, promotion, support from superiors or government, good health, and a strong sense of identity. When the Sun is weak or afflicted, the period may involve challenges related to father, authority figures, government matters, or health (heart, bones, eyes). Ego clashes and opposition from others are also possible. The outcome depends on the Sun's house, sign, strength, and aspects in your natal chart."
    },
    "Moon": {
      "duration_years": 10,
      "summary": "Moon Mahadasha extends for 10 years and governs mind, emotions, mother, travel, and day-to-day comfort.\n\nWhen the Moon is strong and well placed, this period can support mental peace, gains through mother or women, travel, and fluctuating but overall positive fortunes. There may be interest in nurturing work, hospitality, or creative fields. When the Moon is weak or afflicted, the mind can be restless, emotions unstable, and there may be worries related to mother, health, or changing circumstances. Results depend on the Moon's sign, nakshatra, house, and aspects in your chart."
    },
    "Mars": {
      "duration_years": 7,
      "summary": "Mars Mahadasha runs for 7 years and brings themes of courage, property, siblings, and action, along with possible conflict or injury.\n\nWhen Mars is strong and well placed, the period can support property matters, technical or engineering success, courage to take risks, and gains through siblings or land. When Mars is weak or in difficult houses (e.g. 6th, 8th, 12th), there may be disputes, accidents, surgery, or financial strain. Anger and impulsiveness need to be watched. The effects depend on Mars's house, sign, dignity, and aspects in your birth chart."
    },
    "Rahu": {
      "duration_years": 18,
      "summary": "Rahu Mahadasha lasts 18 years and often creates strong material ambition, sudden events, and confusion between right and wrong.\n\nWhen Rahu is well placed in friendly signs (e.g. Taurus, Gemini, Cancer, Virgo, Libra, Capricorn, Aquarius), it can bring sudden wealth, foreign travel or settlement, success in technology or unconventional fields, and material gains. When Rahu is afflicted, the native may feel never satisfied, susceptible to wrong company, gambling, or moral confusion. There can be sudden reversals, unexpected enemies, or health issues. Results depend heavily on Rahu's house, sign, and nakshatra in your chart."
    },
    "Jupiter": {
      "duration_years": 16,
      "summary": "Jupiter Mahadasha runs for 16 years and typically supports wisdom, higher education, children, and overall fortune.\n\nWhen Jupiter is strong and well placed (e.g. in own or exaltation sign, or in kendra/trikona), the period can bring growth in knowledge, spirituality, children, wealth, and reputation. There may be support from teachers, elders, and through legal or religious matters. When Jupiter is weak or afflicted, the same areas can see delays, disputes, or over-optimism leading to loss. The results depend on Jupiter's house, sign, dignity, and the houses it rules in your chart."
    },
    "Saturn": {
      "duration_years": 19,
      "summary": "Saturn Mahadasha lasts 19 years and is a period of discipline, delay, hard work, and long-term karmic results.\n\nWhen Saturn is well placed (e.g. in own or exaltation sign, or as a functional benefic for your ascendant), the period can bring steady growth, maturity, responsibility, gains through hard work, and recognition after sustained effort—often more visible after the age of 35–40. When Saturn is weak or afflicted, there may be delays, obstacles, separation, health issues, or financial strain. Saturn demands sincerity and patience; success rarely comes overnight. The effects depend on Saturn's house, sign, and strength in your birth chart."
    },
    "Mercury": {
      "duration_years": 17,
      "summary": "Mercury Mahadasha runs for 17 years and influences business, communication, education, and intellect.\n\nWhen Mercury is strong and well placed, the period can support gains through trade, writing, teaching, accounts, or technology. There may be success in studies, short travel, and networking. When Mercury is weak or afflicted, there can be nervous tension, speech or communication issues, or financial ups and downs. The results depend on Mercury's house, sign, conjunctions, and the houses it rules in your chart."
    }
  },
  "antardasha_note": "Antardasha effects combine the themes of the Mahadasha lord with the Antardasha lord. For precise results, consider the placement and strength of both planets in your birth chart. Refer to BPHS Chapter 59 or your classical text for house-wise and sign-wise details.",
  "antardasha": {
    "Ketu-Ketu": "During Ketu Mahadasha Ketu Antardasha, the themes of Ketu are at their peak: spiritual focus, detachment from worldly attachments, and sudden changes in circumstances. You may feel a strong pull towards meditation, occult studies, or letting go of old patterns. Career and relationships can see unexpected turns. If Ketu is strong in your chart, this can be a time of inner clarity and spiritual progress; if weak, be careful of confusion, financial oversight, or stress from sudden events.",
    "Ketu-Venus": "In Ketu Mahadasha Venus Antardasha, the detachment of Ketu mixes with Venus's desire for comfort, relationship, and beauty. You may experience fluctuations in love life and finances—sometimes a sudden marriage or gain, sometimes a cooling of attachment or expenditure. Balance between spiritual inclination and material comfort is tested. Results depend on the placement and strength of both Ketu and Venus in your chart.",
    "Ketu-Sun": "Ketu Mahadasha Sun Antardasha brings together Ketu's detachment and the Sun's themes of authority, father, and self. Authority or father may be affected; you may gain or lose support from seniors or government. Interest in spirituality or politics can increase. Ego and identity may go through a phase of revaluation. The outcome depends on the dignity of both Ketu and Sun in your birth chart.",
    "Ketu-Moon": "During Ketu Mahadasha Moon Antardasha, the mind and emotions are strongly influenced. You may feel restless, detached from routine, or drawn to meditation and travel. Relationship with mother or women can see changes. Clarity of thought may alternate with confusion. If Moon and Ketu are well placed, intuition and spiritual practices can flourish; otherwise, take care of emotional and physical health.",
    "Ketu-Mars": "Ketu Mahadasha Mars Antardasha combines Ketu's suddenness with Mars's courage and aggression. You may take bold steps in career or property matters but also face disputes or impulsive decisions. There can be changes in job, place, or relationship due to clashes of opinion. When both are strong, initiative and success in technical or property matters are possible; when weak, avoid unnecessary conflict and rash actions.",
    "Ketu-Rahu": "Ketu Mahadasha Rahu Antardasha is a period of strong contrast: Ketu seeks detachment while Rahu seeks material fulfilment. Confusion between spiritual and material goals is common. Sudden events—both gains and reversals—can occur. Clarity in decision-making may be low. It is advisable to avoid speculative or unethical ventures and to rely on clear guidance from trusted sources.",
    "Ketu-Jupiter": "In Ketu Mahadasha Jupiter Antardasha, Jupiter's wisdom and spirituality soften Ketu's effects. Interest in higher knowledge, scriptures, or spiritual teachers may increase. Gains through elders, education, or righteous means are possible when both are well placed. Take advantage of this phase for learning and inner growth; avoid over-optimism or excessive expenditure.",
    "Ketu-Saturn": "Ketu Mahadasha Saturn Antardasha (about 1 year 2 months) brings together two karmic planets: Ketu (spiritual detachment, sudden change) and Saturn (discipline, delay, hard work). It is often a challenging but transformative period. You may face sudden endings, confusion in relationships, or major turning points in career and family. There can be loss of wealth, fear, conflict, or separation. At the same time, this combination offers hidden blessings for spiritual growth: it helps remove illusions, clarify life purpose, and resolve karmic patterns through discipline and introspection. Career may shift towards more meaningful work. Relationships may go through a phase of clarity as weak bonds fade and trust is tested. The actual impact depends on the house and sign placement of both Ketu and Saturn in your birth chart.",
    "Ketu-Mercury": "Ketu Mahadasha Mercury Antardasha blends Ketu's detachment with Mercury's intellect and communication. You may be drawn to research, writing, or analytical work with a spiritual or unconventional angle. Business and communication can see sudden changes. When both are strong, success in learning or innovative projects is possible; when weak, avoid hasty decisions and protect against miscommunication or financial oversight.",
    "Venus-Ketu": "Venus Mahadasha Ketu Antardasha mixes Venus's love of comfort, beauty, and relationship with Ketu's spiritual detachment. You may feel torn between material desires and a pull toward introspection or spirituality. Relationships can see confusion, withdrawal, or unnecessary conflict; there may be emotional upheaval or temporary separation. Finances can fluctuate—sometimes loss through expenditure or unwise decisions, sometimes unexpected gains later in the sub-period. When both are well placed, inner healing and creative or spiritual depth are possible. Health-wise, take care of stress, hormones, and lifestyle balance. Results depend on Venus and Ketu's house and sign in your chart.",
    "Venus-Venus": "Venus Mahadasha Venus Antardasha doubles Venus's influence: marriage, partnership, arts, luxury, and comfort are strongly highlighted. This can be a favourable time for romantic commitment, marriage, gains through creative or beauty-related work, and overall material comfort when Venus is strong. When Venus is weak or afflicted, over-expenditure, relationship strain, or delays in these areas may occur. The period is ideal for working on relationships and financial discipline.",
    "Venus-Sun": "Venus Mahadasha Sun Antardasha combines Venus's charm and luxury with the Sun's authority and vitality. You may gain recognition, support from seniors or government, or a rise in status. Relationship with father or authority figures can improve. When both are well placed, wealth and reputation can grow; when afflicted, ego clashes or over-spending may cause strain.",
    "Venus-Moon": "Venus Mahadasha Moon Antardasha brings together Venus's love of comfort and the Moon's emotions and mother. Mind and relationships are in focus—possible gains through women, mother, or creative work, and emotional fulfilment. When well placed, peace, marriage, and financial comfort are supported; when weak, mood swings or financial indecision may appear.",
    "Venus-Mars": "Venus Mahadasha Mars Antardasha mixes Venus's desire for harmony with Mars's energy and aggression. Passion in love or partnership can increase, but so can arguments or impulsive decisions. Property or legal matters may surface. When both are strong, success through partnership or property is possible; when afflicted, avoid disputes and rash expenditure.",
    "Venus-Rahu": "Venus Mahadasha Rahu Antardasha can bring sudden or unconventional developments in love, marriage, or wealth. Desire for material and social success is strong; there may be confusion in relationships or attraction to the wrong people. When Rahu is well placed, sudden gains or foreign connection in these areas are possible; when weak, avoid speculation and unethical shortcuts.",
    "Venus-Jupiter": "Venus Mahadasha Jupiter Antardasha is generally supportive: Jupiter's wisdom and fortune reinforce Venus's themes. Marriage, children, higher education, and wealth can be favoured when both are well placed. Spiritual or religious pursuits may bring peace. If either planet is afflicted, over-optimism or expenditure may need to be checked.",
    "Venus-Saturn": "Venus Mahadasha Saturn Antardasha brings delay and discipline into Venus's domains. Marriage or relationship may be delayed or tested; finances may grow slowly but steadily. When Saturn is a benefic for your chart, long-term stability in partnership and wealth is possible; when afflicted, coldness or separation in relationship and financial strain may occur.",
    "Venus-Mercury": "Venus Mahadasha Mercury Antardasha supports business, communication, and creative or intellectual partnership. Gains through trade, writing, or arts are possible. When both are strong, wealth and intellect combine well; when weak, avoid verbal conflict and financial carelessness.",
    "Sun-Ketu": "Sun Mahadasha Ketu Antardasha blends the Sun's authority and self with Ketu's detachment. Relationship with father or superiors may change; you may lose or gain their support. Interest in spirituality or politics can rise. When Ketu is strong, spiritual or unconventional success is possible; when weak, avoid confusion in authority matters and protect reputation.",
    "Sun-Venus": "Sun Mahadasha Venus Antardasha can bring recognition along with comfort, marriage, or creative success. Support from spouse or seniors is possible. When both are well placed, status and relationship improve; when afflicted, ego or over-spending may cause issues.",
    "Sun-Sun": "Sun Mahadasha Sun Antardasha strongly emphasises authority, father, government, and vitality. This can be a peak period for recognition, promotion, or health when the Sun is strong. When the Sun is weak, challenges related to father, government, or heart may need attention.",
    "Sun-Moon": "Sun Mahadasha Moon Antardasha combines the Sun's authority with the Moon's mind and mother. Emotional and professional life are both active. When well placed, gains through mother, travel, or government connection are possible; when afflicted, mind or mother may need care.",
    "Sun-Mars": "Sun Mahadasha Mars Antardasha brings courage and drive to the Sun's themes. Initiative in career or property can increase, but so can anger or conflict with others. When both are strong, success through bold action is possible; when weak, avoid disputes and rash decisions.",
    "Sun-Rahu": "Sun Mahadasha Rahu Antardasha can bring sudden or unconventional gains in status but also confusion and ego issues. Relationship with father or government may be mixed. When Rahu is well placed, sudden rise or foreign connection is possible; when afflicted, protect reputation and avoid unethical means.",
    "Sun-Jupiter": "Sun Mahadasha Jupiter Antardasha is generally favourable: Jupiter's wisdom supports the Sun's authority. Gains through higher education, children, or seniors are possible. When both are strong, recognition and fortune can grow; when weak, over-optimism or delay may appear.",
    "Sun-Saturn": "Sun Mahadasha Saturn Antardasha introduces delay and discipline. Authority or father may be tested; career may progress slowly. When Saturn is benefic, long-term stability and recognition are possible; when afflicted, coldness from seniors or health issues may need attention.",
    "Sun-Mercury": "Sun Mahadasha Mercury Antardasha supports intellect, communication, and business in the context of authority or government. When both are strong, success in administration or writing is possible; when weak, avoid verbal conflict and protect nervous health.",
    "Moon-Ketu": "Moon Mahadasha Ketu Antardasha creates emotional restlessness and a pull toward spirituality or detachment from routine. Mind may feel unsettled; relationship with mother or women can change. When Ketu is strong, intuition and spiritual practices can deepen; when weak, protect mental peace and avoid confusion in decisions.",
    "Moon-Venus": "Moon Mahadasha Venus Antardasha favours emotional fulfilment, comfort, and relationship. Marriage or creative pursuits can be supported when both are well placed. When afflicted, mood swings or over-attachment in love may need balance.",
    "Moon-Sun": "Moon Mahadasha Sun Antardasha blends mind and emotions with authority and vitality. Support from father or government may influence emotional security. When well placed, recognition and peace are possible; when weak, ego or mind may be under strain.",
    "Moon-Moon": "Moon Mahadasha Moon Antardasha strongly emphasises mind, mother, travel, and emotions. This can be a period of fluctuating fortunes and strong emotional sensitivity. When the Moon is strong, gains through mother, travel, or nurturing work are possible; when weak, protect mental and physical health.",
    "Moon-Mars": "Moon Mahadasha Mars Antardasha can make emotions intense and sometimes aggressive. Courage and initiative rise but so can anger or impulsiveness. When both are strong, success through bold emotional or property moves is possible; when weak, avoid disputes and protect relationships.",
    "Moon-Rahu": "Moon Mahadasha Rahu Antardasha often brings confusion in mind and relationship. Desire for material or emotional fulfilment can lead to wrong choices. When Rahu is well placed, sudden gains or unconventional success are possible; when afflicted, protect mental peace and avoid deception.",
    "Moon-Jupiter": "Moon Mahadasha Jupiter Antardasha is generally supportive: Jupiter's wisdom brings emotional and spiritual growth. Gains through children, education, or mother are possible. When both are strong, peace and fortune favour you; when weak, avoid over-optimism and financial carelessness.",
    "Moon-Saturn": "Moon Mahadasha Saturn Antardasha can be emotionally testing. Saturn's coldness and delay can create mental strain, isolation, or feeling misunderstood. When the Moon is strong and well placed, you may achieve clarity and major goals despite hardship; when afflicted, depression, anxiety, or family issues may surface. Financial and relationship decisions need care.",
    "Moon-Mercury": "Moon Mahadasha Mercury Antardasha supports communication, learning, and business with an emotional touch. When both are strong, success in writing, trade, or short travel is possible; when weak, nervous tension or indecision may appear.",
    "Mars-Ketu": "Mars Mahadasha Ketu Antardasha mixes Mars's courage with Ketu's sudden change. Career or property may see unexpected turns; spirituality or research may attract you. When both are strong, success in technical or unconventional fields is possible; when weak, avoid impulsive action and protect from accidents.",
    "Mars-Venus": "Mars Mahadasha Venus Antardasha combines passion with desire for beauty and relationship. Love and partnership can be intense; there may be gains or strain through spouse or creative work. When well placed, success through partnership or arts is possible; when afflicted, avoid jealousy and rash expenditure.",
    "Mars-Sun": "Mars Mahadasha Sun Antardasha brings drive to authority and career. Initiative and recognition can increase, but so can conflict with seniors. When both are strong, promotion or property gains are possible; when weak, avoid disputes and protect from injury.",
    "Mars-Moon": "Mars Mahadasha Moon Antardasha makes emotions and courage work together. You may take bold emotional or career steps. When well placed, success through mother, property, or travel is possible; when afflicted, mood swings or aggression may need control.",
    "Mars-Mars": "Mars Mahadasha Mars Antardasha doubles Mars's energy: courage, property, and action are at the fore. This can be a period of high initiative but also of conflict or injury risk. When Mars is strong, property and technical success are favoured; when weak, avoid disputes and rash decisions.",
    "Mars-Rahu": "Mars Mahadasha Rahu Antardasha can bring sudden or aggressive pursuit of ambition. Success in technology or unconventional fields is possible, but so are confusion and conflict. When Rahu is well placed, sudden gains may come; when afflicted, avoid unethical means and protect from accidents.",
    "Mars-Jupiter": "Mars Mahadasha Jupiter Antardasha generally supports courage with wisdom. Gains through property, children, or higher education are possible when both are strong. When weak, avoid over-confidence and legal disputes.",
    "Mars-Saturn": "Mars Mahadasha Saturn Antardasha introduces delay and discipline into Mars's domains. Property or career may progress slowly; there may be obstacles or coldness from others. When Saturn is benefic, long-term gains through hard work are possible; when afflicted, avoid disputes and protect health.",
    "Mars-Mercury": "Mars Mahadasha Mercury Antardasha supports business, communication, and technical work. When both are strong, success in trade, writing, or engineering is possible; when weak, avoid verbal conflict and impulsive contracts.",
    "Rahu-Ketu": "Rahu Mahadasha Ketu Antardasha brings together two nodes: material ambition (Rahu) and spiritual detachment (Ketu). Confusion and sudden events are common. When well balanced, spiritual insight or unconventional success is possible; when afflicted, avoid speculation and protect mental peace.",
    "Rahu-Venus": "Rahu Mahadasha Venus Antardasha can bring sudden or unconventional developments in love, marriage, or luxury. Desire for material and romantic success is strong. When well placed, sudden marriage or wealth is possible; when afflicted, avoid wrong relationships and over-expenditure.",
    "Rahu-Sun": "Rahu Mahadasha Sun Antardasha can create mixed results with authority and father. Sudden rise or fall in status is possible. When Rahu is strong, unconventional recognition may come; when weak, protect reputation and relationship with father.",
    "Rahu-Moon": "Rahu Mahadasha Moon Antardasha often creates mental restlessness and strong desires. Emotions and material pursuits can be intense. When well placed, sudden gains through women or travel are possible; when afflicted, protect mind and avoid deception.",
    "Rahu-Mars": "Rahu Mahadasha Mars Antardasha combines ambition with courage and aggression. Success in technology, engineering, or property is possible but so are conflict and risk. When both are strong, bold gains may come; when weak, avoid disputes and unethical action.",
    "Rahu-Rahu": "Rahu Mahadasha Rahu Antardasha doubles Rahu's influence: material ambition and sudden events peak. This can be a period of major gains or major confusion. When Rahu is well placed, wealth and foreign connection are possible; when afflicted, avoid speculation and wrong company.",
    "Rahu-Jupiter": "Rahu Mahadasha Jupiter Antardasha combines Rahu's ambition with Jupiter's wisdom. Interest in spirituality, higher education, or philosophy can grow; career and wealth may benefit from foreign or mentor support. When Jupiter is strong, fame and wealth through knowledge are possible; when weak, confusion or financial strain may occur.",
    "Rahu-Saturn": "Rahu Mahadasha Saturn Antardasha can bring delay, obstacles, or sudden reversals. Discipline and ambition clash. When Saturn is benefic, long-term gains after struggle are possible; when afflicted, avoid shortcuts and protect from loss or conflict.",
    "Rahu-Mercury": "Rahu Mahadasha Mercury Antardasha supports business, communication, and technology with Rahu's unconventional touch. When well placed, success in computing, trade, or writing is possible; when afflicted, avoid fraud and verbal conflict.",
    "Jupiter-Ketu": "Jupiter Mahadasha Ketu Antardasha blends Jupiter's wisdom with Ketu's spirituality. Interest in philosophy, religion, or higher knowledge can deepen; detachment from material pursuits may grow. When both are strong, spiritual and educational gains are possible; when weak, avoid confusion in beliefs and financial oversight.",
    "Jupiter-Venus": "Jupiter Mahadasha Venus Antardasha is generally favourable: wisdom supports love, marriage, and comfort. Gains through spouse, children, or creative work are possible when both are well placed. When afflicted, over-expenditure or relationship indulgence may need balance.",
    "Jupiter-Sun": "Jupiter Mahadasha Sun Antardasha supports authority with wisdom. Recognition, support from government or seniors, and gains through father are possible. When both are strong, status and fortune can grow; when weak, avoid over-optimism and ego clashes.",
    "Jupiter-Moon": "Jupiter Mahadasha Moon Antardasha favours mind, mother, and emotional growth. Peace, travel, and gains through women or nurturing work are possible when well placed. When afflicted, mood or financial indecision may need attention.",
    "Jupiter-Mars": "Jupiter Mahadasha Mars Antardasha combines wisdom with courage. Success in property, technical work, or through siblings is possible when both are strong. When weak, avoid legal disputes and rash decisions.",
    "Jupiter-Rahu": "Jupiter Mahadasha Rahu Antardasha can bring growth in career, wealth, or education but also confusion where right and wrong blur. When Rahu is well placed, sudden gains through knowledge or foreign connection are possible; when afflicted, avoid speculation and wrong guidance.",
    "Jupiter-Jupiter": "Jupiter Mahadasha Jupiter Antardasha strongly emphasises wisdom, children, education, and fortune. This can be a peak period for spiritual and material growth when Jupiter is strong. When weak, over-optimism or delay in these areas may occur.",
    "Jupiter-Saturn": "Jupiter Mahadasha Saturn Antardasha mixes expansion with delay and discipline. Career and status can grow steadily but slowly; marriage or long-term plans may be tested. When Saturn is benefic, lasting gains and stability are possible; when afflicted, delays or pressure in career and family may appear.",
    "Jupiter-Mercury": "Jupiter Mahadasha Mercury Antardasha supports learning, business, and communication with Jupiter's blessing. Gains through trade, writing, or education are possible when both are strong. When weak, avoid over-confidence in contracts and protect nervous health.",
    "Saturn-Ketu": "Saturn Mahadasha Ketu Antardasha is a spiritually intense combination: discipline meets detachment. You may face sudden endings, confusion in relationships, or major career turns; loss, fear, or separation are possible. At the same time, it offers scope for karmic clarity, removal of illusions, and a shift toward meaningful work. Results depend on both planets' placement in your chart.",
    "Saturn-Venus": "Saturn Mahadasha Venus Antardasha brings delay and seriousness into love, marriage, and comfort. Relationship or marriage may be delayed or tested; finances may grow slowly. When Venus is well placed, long-term stability in partnership and wealth is possible; when afflicted, coldness or separation may occur.",
    "Saturn-Sun": "Saturn Mahadasha Sun Antardasha can strain relationship with father or authority. Career may progress slowly; recognition may be delayed. When the Sun is strong, perseverance can eventually bring status; when weak, avoid conflict with seniors and protect vitality.",
    "Saturn-Moon": "Saturn Mahadasha Moon Antardasha can be emotionally challenging: Saturn's coldness can create mental strain, isolation, or a feeling of being misunderstood. When the Moon is strong and well placed, you may achieve clarity and major accomplishments; when afflicted, depression, anxiety, or family issues may surface. Financial and emotional decisions need care.",
    "Saturn-Mars": "Saturn Mahadasha Mars Antardasha combines discipline with courage and possible conflict. Property or career may see obstacles or delay; there may be disputes or injury risk. When both are strong, success through sustained effort is possible; when weak, avoid aggression and protect health.",
    "Saturn-Rahu": "Saturn Mahadasha Rahu Antardasha can bring confusion, sudden obstacles, or mixed results in career and relationship. When Rahu is well placed, unconventional gains after struggle are possible; when afflicted, avoid shortcuts and protect from loss or deception.",
    "Saturn-Jupiter": "Saturn Mahadasha Jupiter Antardasha is generally supportive for career growth and status. Jupiter's wisdom can ease Saturn's delay; financial growth, family expansion, and gains through government or elders are possible when both are well placed. When either is weak, delays or wrong decisions in long-term plans may occur.",
    "Saturn-Saturn": "Saturn Mahadasha Saturn Antardasha doubles Saturn's influence: discipline, delay, and karmic results are at their peak. This can be a period of major responsibility, hardship, or eventual stability. When Saturn is strong, long-term gains and maturity are possible; when weak, health, loss, or separation may need attention.",
    "Saturn-Mercury": "Saturn Mahadasha Mercury Antardasha brings delay and seriousness into business and communication. When Mercury is strong, success in trade, writing, or accounts after sustained effort is possible; when weak, nervous tension or contractual disputes may appear.",
    "Mercury-Ketu": "Mercury Mahadasha Ketu Antardasha blends intellect with detachment and sudden change. Interest in research, occult, or unconventional learning may grow; business can see unexpected turns. When both are strong, success in innovative or spiritual-intellectual work is possible; when weak, avoid confusion in contracts and communication.",
    "Mercury-Venus": "Mercury Mahadasha Venus Antardasha supports business, arts, and partnership. Gains through trade, creative work, or spouse are possible when both are well placed. When afflicted, over-expenditure or verbal conflict in relationship may need balance.",
    "Mercury-Sun": "Mercury Mahadasha Sun Antardasha combines intellect with authority. Success in administration, government-related work, or writing is possible when both are strong. When weak, avoid ego clashes and protect reputation.",
    "Mercury-Moon": "Mercury Mahadasha Moon Antardasha favours mind, communication, and emotional expression. Gains through writing, travel, or mother are possible when well placed. When afflicted, nervous tension or mood swings may need care.",
    "Mercury-Mars": "Mercury Mahadasha Mars Antardasha supports technical work, business, and initiative. When both are strong, success in engineering, trade, or property-related work is possible; when weak, avoid verbal conflict and impulsive deals.",
    "Mercury-Rahu": "Mercury Mahadasha Rahu Antardasha can bring sudden or unconventional success in business or technology but also confusion and risk. When Rahu is well placed, gains through computing or unconventional trade are possible; when afflicted, avoid fraud and miscommunication.",
    "Mercury-Jupiter": "Mercury Mahadasha Jupiter Antardasha is generally favourable: wisdom supports business and learning. Gains through education, trade, or children are possible when both are strong. When weak, avoid over-optimism in contracts and financial decisions.",
    "Mercury-Saturn": "Mercury Mahadasha Saturn Antardasha brings delay and discipline into business and communication. When Saturn is benefic, long-term success in trade or writing after hard work is possible; when afflicted, nervous strain or contractual delays may occur.",
    "Mercury-Mercury": "Mercury Mahadasha Mercury Antardasha strongly emphasises intellect, communication, and business. This can be a peak period for learning, trade, and writing when Mercury is strong. When weak, avoid nervous strain, verbal conflict, and financial carelessness."
  }
}
