{
  "chart_type": "D10",
  "chart_name": "Dasamsa",
  "purpose": "Career and Profession",
  "meanings": {
    "Sun": {
      "1": "Strong leadership qualities, natural authority, recognition in career. You have the charisma to lead and inspire others.",
      "2": "Wealth through career, financial stability, good earning capacity. Your profession brings material prosperity.",
      "3": "Courage, communication skills, success through writing or media. Career in communications, journalism, or creative writing.",
      "4": "Career in real estate, agriculture, or property-related fields. Success through land, property, or mother-related businesses.",
      "5": "Creative career, teaching, speculation, or entertainment industry. Success through creativity, education, or investments.",
      "6": "Success over competitors, career in service, healthcare, or law. You excel in competitive environments and service-oriented professions.",
      "7": "Partnerships in business, career through spouse or partners. Success through collaborations and business partnerships.",
      "8": "Hidden sources of income, career in research or occult sciences. Unconventional career paths, research, or transformation.",
      "9": "Career aligned with dharma, teaching, philosophy, or long-distance travel. Success through higher knowledge and spiritual pursuits.",
      "10": "Excellent career prospects, high position, recognition, authority. You achieve great success and recognition in your profession.",
      "11": "Gains through career, networking, friends help in profession. Success through social connections and networking.",
      "12": "Career abroad, foreign connections, or career in spiritual fields. Success through international work or spiritual pursuits."
    },
    "Moon": {
      "1": "Public recognition, career in public service or media. You have a public-facing career with recognition.",
      "2": "Wealth through business, food industry, or liquid assets. Success in food, beverages, or financial sectors.",
      "3": "Career in communication, writing, or short-distance travel. Success through writing, media, or local business.",
      "4": "Career in real estate, mother-related fields, or comfort-oriented work. Success through property, hospitality, or caregiving.",
      "5": "Creative career, teaching, or entertainment. Success through creativity, education, or performing arts.",
      "6": "Service-oriented career, healthcare, or overcoming obstacles. Success in service, healthcare, or competitive fields.",
      "7": "Career through partnerships, public relations, or hospitality. Success through partnerships and public relations.",
      "8": "Hidden career opportunities, research, or transformation. Unconventional career paths or research work.",
      "9": "Career in teaching, philosophy, or long-distance travel. Success through higher education or international work.",
      "10": "Fluctuating career, but good public image. Career may have ups and downs but maintains good reputation.",
      "11": "Gains through networking, friends, or social media. Success through social connections and networking.",
      "12": "Career abroad, spiritual pursuits, or behind-the-scenes work. Success through international or spiritual work."
    },
    "Mars": {
      "1": "Dynamic leadership, career in military, sports, or engineering. Strong drive and leadership in action-oriented fields.",
      "2": "Wealth through courage and action, but may have expenses. Success through bold actions, but need to manage finances carefully.",
      "3": "Career in communication, writing, or technical fields. Success in technical writing, engineering, or communications.",
      "4": "Career in real estate, construction, or property. Success in construction, real estate, or property development.",
      "5": "Career in sports, entertainment, or creative fields. Success in sports, entertainment, or creative industries.",
      "6": "Excellent for competitive careers, law, or healthcare. Strong in competitive environments, law, or healthcare.",
      "7": "Career through partnerships, but may have conflicts. Success through partnerships, but need to manage conflicts.",
      "8": "Career in research, investigation, or transformation. Success in research, investigation, or transformative work.",
      "9": "Career in law, philosophy, or long-distance travel. Success in law, philosophy, or international work.",
      "10": "Strong career drive, leadership positions, but may have conflicts. High ambition and leadership, but need to manage conflicts.",
      "11": "Gains through courage and networking. Success through bold actions and social connections.",
      "12": "Career abroad, hidden enemies, or spiritual transformation. Success through international work or spiritual pursuits."
    },
    "Mercury": {
      "1": "Career in communication, writing, or business. Success through communication, writing, or business skills.",
      "2": "Wealth through business, writing, or communication. Success in business, writing, or communication-related fields.",
      "3": "Excellent for writing, communication, or media careers. Strong in writing, media, or communication fields.",
      "4": "Career in education, real estate, or property. Success in education, real estate, or property management.",
      "5": "Career in teaching, writing, or creative fields. Success in education, writing, or creative industries.",
      "6": "Career in service, healthcare, or technical writing. Success in service, healthcare, or technical fields.",
      "7": "Career through partnerships, business, or trade. Success through business partnerships and trade.",
      "8": "Career in research, investigation, or technical analysis. Success in research, investigation, or analysis.",
      "9": "Career in teaching, philosophy, or long-distance communication. Success in education, philosophy, or international communication.",
      "10": "Career in business, communication, or administration. Success in business, communication, or administrative roles.",
      "11": "Gains through networking, friends, or communication. Success through social connections and communication.",
      "12": "Career abroad, writing, or behind-the-scenes communication. Success through international work or writing."
    },
    "Jupiter": {
      "1": "Career in teaching, law, or spiritual fields, high recognition. Blessed with wisdom and recognition in teaching or law.",
      "2": "Wealth through knowledge, teaching, or guidance. Money follows when you invest in skills, education, or leadership roles.",
      "3": "Career in writing, teaching, or communication. Success in education, writing, or communication.",
      "4": "Career in education, real estate, or property. Success in education, real estate, or property management.",
      "5": "Career in teaching, philosophy, or creative education. Success in education, philosophy, or creative teaching.",
      "6": "Career in law, teaching, or service. Success in law, education, or service-oriented fields.",
      "7": "Career through partnerships, especially in education or law. Success through educational or legal partnerships.",
      "8": "Career in research, philosophy, or transformation. Success in research, philosophy, or transformative work.",
      "9": "Excellent for teaching, philosophy, or spiritual careers. Great success in education, philosophy, or spiritual work.",
      "10": "High position, recognition, career in law, teaching, or administration. Achieve high status in law, education, or administration.",
      "11": "Gains through knowledge, networking, or guidance. Success through wisdom, social connections, or mentorship.",
      "12": "Career abroad, spiritual pursuits, or teaching. Success through international work, spirituality, or education."
    },
    "Venus": {
      "1": "Career in arts, beauty, luxury, or entertainment. Success in arts, beauty, luxury, or entertainment industries.",
      "2": "Wealth through arts, beauty, or luxury businesses. Success in arts, beauty, or luxury-related businesses.",
      "3": "Career in arts, communication, or creative writing. Success in arts, communication, or creative fields.",
      "4": "Career in real estate, property, or comfort-oriented fields. Success in real estate, property, or hospitality.",
      "5": "Career in arts, entertainment, or creative fields. Success in arts, entertainment, or creative industries.",
      "6": "Career in service, healthcare, or beauty industry. Success in service, healthcare, or beauty-related fields.",
      "7": "Career through partnerships, especially in arts or business. Success through artistic or business partnerships.",
      "8": "Career in research, transformation, or hidden arts. Success in research, transformation, or behind-the-scenes creative work.",
      "9": "Career in arts, philosophy, or long-distance travel. Success in arts, philosophy, or international work.",
      "10": "Career in arts, luxury, or entertainment industry. Success in arts, luxury, or entertainment fields.",
      "11": "Gains through arts, networking, or luxury businesses. Success through arts, social connections, or luxury businesses.",
      "12": "Career abroad, spiritual arts, or behind-the-scenes creative work. Success through international or spiritual creative work."
    },
    "Saturn": {
      "1": "Delayed but stable career, career in old age, or government service. Career success comes later but is stable and long-lasting.",
      "2": "Wealth through hard work, but may have delays. Success through persistence, but requires patience and discipline.",
      "3": "Career in communication, but with delays or obstacles. Success in communication, but may face delays or challenges.",
      "4": "Career in real estate, property, or old structures. Success in real estate, property, or traditional structures.",
      "5": "Career in teaching or creative fields, but with delays. Success in education or creativity, but requires patience.",
      "6": "Career in service, healthcare, or overcoming obstacles. Success in service, healthcare, or competitive fields.",
      "7": "Career through partnerships, but may have delays or obstacles. Success through partnerships, but requires patience.",
      "8": "Career in research, transformation, or long-lasting work. Success in research, transformation, or enduring work.",
      "9": "Career in philosophy, teaching, or long-distance travel. Success in philosophy, education, or international work.",
      "10": "Delayed but stable career, government service, or authority. Career success comes later but achieves high status.",
      "11": "Gains through hard work, networking, or old friends. Success through persistence and long-term connections.",
      "12": "Career abroad, spiritual pursuits, or isolation. Success through international work, spirituality, or behind-the-scenes work."
    },
    "Rahu": {
      "1": "Unconventional career, technology, or foreign connections. Success through innovative, technological, or international work.",
      "2": "Wealth through unconventional means or technology. Success through innovative or technological approaches.",
      "3": "Career in communication, technology, or media. Success in technology, media, or communication fields.",
      "4": "Career in real estate, property, or unconventional fields. Success in real estate or unconventional property-related work.",
      "5": "Career in technology, entertainment, or creative fields. Success in technology, entertainment, or creative industries.",
      "6": "Career in service, technology, or overcoming obstacles. Success in technology, service, or competitive fields.",
      "7": "Career through partnerships, especially foreign or unconventional. Success through international or unconventional partnerships.",
      "8": "Career in research, technology, or transformation. Success in research, technology, or transformative work.",
      "9": "Career in philosophy, technology, or long-distance travel. Success in philosophy, technology, or international work.",
      "10": "Unconventional career, technology, or high position. Achieve high status through innovation or technology.",
      "11": "Gains through networking, technology, or unconventional means. Success through technology, networking, or innovation.",
      "12": "Career abroad, technology, or spiritual transformation. Success through international work, technology, or spirituality."
    },
    "Ketu": {
      "1": "Spiritual career, research, or behind-the-scenes work. Success in research, spirituality, or behind-the-scenes work.",
      "2": "Wealth through research, spirituality, or hidden sources. Success through research, spirituality, or unconventional means.",
      "3": "Career in communication, research, or writing. Success in research, writing, or communication.",
      "4": "Career in real estate, property, or hidden fields. Success in real estate or behind-the-scenes property work.",
      "5": "Career in research, spirituality, or creative fields. Success in research, spirituality, or creative work.",
      "6": "Career in service, research, or overcoming obstacles. Success in service, research, or competitive fields.",
      "7": "Career through partnerships, especially spiritual or research. Success through spiritual or research partnerships.",
      "8": "Career in research, transformation, or spiritual fields. Success in research, transformation, or spiritual work.",
      "9": "Career in philosophy, spirituality, or long-distance travel. Success in philosophy, spirituality, or international work.",
      "10": "Spiritual career, research, or behind-the-scenes authority. Achieve recognition in research, spirituality, or behind-the-scenes work.",
      "11": "Gains through research, spirituality, or networking. Success through research, spirituality, or social connections.",
      "12": "Career abroad, spirituality, or complete transformation. Success through international work, spirituality, or transformation."
    }
  }
}
